"""
Описание задачи:
Дано целое число N. Необходимо вывести все элементы последовательности Фибоначчи
до этого числа.

Послежовательность Фибоначчи - такая последовательность натуральных чисел, что 
каждое следующее число в последовательности является суммой двух предыдущих.
Два начальных элемента последовательности: 1, 1

Примечание: Необходимо проверить, что введенная строка действительно является числом.
Также необходимо проверить, что введенное число больше нуля и целое (то есть, является натуральным).
"""